sts-request-new.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <Action xmlns="http://www.w3.org/2005/08/addressing">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</Action>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:215b20fc-46ce-4a97-85db-86605128bdc0</MessageID>
    <To xmlns="http://www.w3.org/2005/08/addressing">https://iamwse.upvsfix.gov.sk:8581/sts/wss11x509</To>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="true">
      <wsu:Timestamp wsu:Id="TS-3ba08320-78ff-4019-bd8f-8e15a480aabb">
        <wsu:Created>2026-02-02T19:00:39.418Z</wsu:Created>
        <wsu:Expires>2026-02-02T20:40:39.418Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-38728882-aa59-4e78-93cb-28f9c1835cba">MIIC0jCCAbqgAwIBAgIJAIIpWbYMSFPBMA0GCSqGSIb3DQEBDQUAMBcxFTATBgNVBAMTDGljby04MzEzMDA0MTAeFw0yNDA5MTAxMjUxMDZaFw0yNjA5MTAxMjUxMDZaMBcxFTATBgNVBAMTDGljby04MzEzMDA0MTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAK8OcM4zLitTQsn5lRjTdUt7gBwmSZlvFjmpqZV8k8A3CokrUID4hzJ0gGdd6xIEsIuL8U6v/a3Y4ux2cJfFbQ5be5lpP3sPtJ0rx+/wh0uCmrPr0YtahZidN0JH1L8AQEV0bH5KCnkXtt41a/S/hpbwhcJWAIfvaynsQDlnHGmL6Mer2njPgLVE5ovQJOBQnsgLZsCJEIS3aXJFv/1cn9rz8uX39R3x8rBGGfNBdbM10RWtN5MQ3RXIto5Nv3PSOD7UcUqaY8XAm9pGsY6owGiQtq/i81OnUElfy8ZqdUbRsqxoM6gvZUsPdT/togaewnQ2zG/z7wNFZUURIShnlMECAwEAAaMhMB8wHQYDVR0OBBYEFMwIshe1F9t18VJoKMEms+Tw0C9zMA0GCSqGSIb3DQEBDQUAA4IBAQAowYdbqZePFp3qKh1tn+bBjiGVTJF90WKkP5mbI9ilKjjZXFZ5MkWc83t6tnk7goTDS2PjlvT9LofDPh+Mrf0GEwYds36UCYM/mHry76BUEq8FdEOYxbza/4OCmZAJ86tH2F1YhQ6TwurZBEuNWOK2S/MEt2puujcwBozWOLs2sOtq0r5Wyn5y5EVGCivmyn/AGpaB0uZkb18VkJ5pyt2Fp0w2K6OjvopuRLF9Aq7A5qMDO11SfwCpNY7KQRTVVnqqv5witaGpsj4yqgTVkxPrrXXAie2U3wsRoOEpECIBNTZ35JJ5dMASuDYSmELDwD907+9KlVttKyRYY+W+C2NA</wsse:BinarySecurityToken>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-0345156e-10e6-452a-bfd9-903811663080">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
            <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/>
          </ds:CanonicalizationMethod>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <ds:Reference URI="#TS-3ba08320-78ff-4019-bd8f-8e15a480aabb">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap"/>
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>Fjonab97LpGfgvJbx8orH6gW1Yo=</ds:DigestValue>
          </ds:Reference>
          <ds:Reference URI="#_05db3fb4-2b4a-40a2-bfd7-3fd46b71b912">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>8Mkdyduw5FcX7fGBBCAReeHnj4k=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>HLv/SedEKC0c5ZO2kxS8TnG/ZV/c0mjC4l7elS1+/xoswsDrThOzTShqN2FJ0DPesQNdLr7DxB30dt3x4WQeKDe9c3LS9W2phiL0gMQ0STrY0DQbPxtdNNjIXK/lHCz0VahuKgvjiSzgEd8MoR0ye0NUp6cd0Ee24l8OG2a1wH9+vfIRVJxhhUGB0oMfMOHJ7LoMpLf98E3Oxb1RCe7fsnoucBCO24fj+5IaESBnYlamc1rvTOLrxEnG9dVPJjHnEsBfD6W3US4ng6lnEMLaei/Nncold7Ym5e4vUWhsbLQkrrDX2PvnMRlx2CSULELYg515VM/36a1x0AEq4OeW1w==</ds:SignatureValue>
        <ds:KeyInfo Id="KI-67bdbae6-4c9b-4370-bd1e-a0e681253965">
          <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STR-1e1b6887-d4a5-4084-a132-e76bc936bc03">
            <wsse:Reference URI="#X509-38728882-aa59-4e78-93cb-28f9c1835cba" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
  </soap:Header>
  <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_05db3fb4-2b4a-40a2-bfd7-3fd46b71b912">
    <wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
      <wst:SecondaryParameters>
        <trust:TokenType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</trust:TokenType>
        <trust:KeyType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType>
      </wst:SecondaryParameters>
      <wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType>
      <wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
        <wsa:EndpointReference xmlns:wsa="http://www.w3.org/2005/08/addressing">
          <wsa:Address>https://eschranka.upvsfixnew.gov.sk/EKSService.svc</wsa:Address>
        </wsa:EndpointReference>
      </wsp:AppliesTo>
    </wst:RequestSecurityToken>
  </soap:Body>
</soap:Envelope>